### 1. Calculate the average rental duration (in days) for each film:

In [11]:
import pymysql 
import sqlalchemy as alch 
from getpass import getpass
import pandas as pd
import os

In [12]:
password = getpass()
dbName = "sakila"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = alch.create_engine(connectionData)

········

In [13]:
query = "SELECT * FROM rental;"
pd.read_sql_query(query, engine)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,days,months,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2023-10-25 16:12:14,None,None,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2023-10-25 16:12:14,None,None,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2023-10-25 16:12:14,None,None,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2023-10-25 16:12:14,None,None,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2023-10-25 16:12:14,None,None,workday
...,...,...,...,...,...,...,...,...,...,...
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2023-10-25 16:12:14,None,None,workday
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2023-10-25 16:12:14,None,None,workday
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2023-10-25 16:12:14,None,None,workday
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2023-10-25 16:12:14,None,None,workday
16044,16059,2023-10-20 18:02:00,4582,130,NaT,1,2023-10-25 18:15:55,None,None,workday

In [15]:
query = '''SELECT
    film.title AS title,
    film.rental_duration AS rental_duration,
    AVG(film.rental_duration) OVER () AS avg_rental_duration
FROM
    film
ORDER BY
    film.title;
'''
pd.read_sql_query(query, engine)

                 title  rental_duration  avg_rental_duration
0     ACADEMY DINOSAUR                6                4.985
1       ACE GOLDFINGER                3                4.985
2     ADAPTATION HOLES                7                4.985
3     AFFAIR PREJUDICE                5                4.985
4          AFRICAN EGG                6                4.985
..                 ...              ...                  ...
995     YOUNG LANGUAGE                6                4.985
996         YOUTH KICK                4                4.985
997       ZHIVAGO CORE                6                4.985
998  ZOOLANDER FICTION                5                4.985
999          ZORRO ARK                3                4.985

[1000 rows x 3 columns]

#### Expected output

|title|rental_duration|avg_rental_duration|
|-----|---------------|-------------------|
|ACADEMY DINOSAUR|6              |4.9850             |
|ACE GOLDFINGER|3              |4.9850             |
|ADAPTATION HOLES|7              |4.9850             |
|AFFAIR PREJUDICE|5              |4.9850             |
|AFRICAN EGG|6              |4.9850             |
|AGENT TRUMAN|3              |4.9850             |
|AIRPLANE SIERRA|6              |4.9850             |
|AIRPORT POLLOCK|6              |4.9850             |
|ALABAMA DEVIL|3              |4.9850             |
|ALADDIN CALENDAR|6              |4.9850             |
|ALAMO VIDEOTAPE|6              |4.9850             |
|ALASKA PHANTOM|6              |4.9850             |
|ALI FOREVER|4              |4.9850             |
|ALICE FANTASIA|6              |4.9850             |

###  2. Calculate the average payment amount for each staff member:

In [16]:
query = '''SELECT
    staff.staff_id,
    CONCAT(staff.first_name, ' ', staff.last_name) AS staff_name,
    AVG(payment.amount) AS avg_payment_amount
FROM
    staff
    JOIN payment ON staff.staff_id = payment.staff_id
GROUP BY
    staff.staff_id, staff_name
ORDER BY
    staff.staff_id;
'''
pd.read_sql_query(query, engine)

   staff_id    staff_name  avg_payment_amount
0         1  Mike Hillyer            4.156568
1         2  Jon Stephens            4.245125

#### Expected output

|staff_id|avg_payment_amount|
|--------|------------------|
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |
|1       |4.156568          |

### 3. Calculate the total revenue for each customer, showing the running total within each customer's rental history:

In [24]:
query = '''WITH CustomerPayments AS (
    SELECT
        customer.customer_id,
        rental.rental_id,
        rental.rental_date,
        payment.amount,
        SUM(payment.amount) OVER (PARTITION BY customer.customer_id ORDER BY rental.rental_date) AS running_total
    FROM
        rental
        JOIN payment ON rental.rental_id = payment.rental_id
        JOIN customer ON rental.customer_id = customer.customer_id
)

SELECT
    customer.customer_id,
    CustomerPayments.rental_id,
    CustomerPayments.rental_date,
    CustomerPayments.amount,
    CustomerPayments.running_total
FROM
    customer
    JOIN CustomerPayments ON customer.customer_id = CustomerPayments.customer_id
ORDER BY
    customer.customer_id, CustomerPayments.rental_id;

'''
pd.read_sql_query(query, engine)

       customer_id  rental_id         rental_date  amount  running_total
0                1         76 2005-05-25 11:30:37    2.99           2.99
1                1        573 2005-05-28 10:35:23    0.99           3.98
2                1       1185 2005-06-15 00:54:12    5.99           9.97
3                1       1422 2005-06-15 18:02:53    0.99          10.96
4                1       1476 2005-06-15 21:08:46    9.99          20.95
...            ...        ...                 ...     ...            ...
15635          599      14599 2005-08-21 17:43:42    4.99          66.85
15636          599      14719 2005-08-21 21:41:57    1.99          68.84
15637          599      15590 2005-08-23 06:09:44    8.99          77.83
15638          599      15719 2005-08-23 11:08:46    2.99          80.82
15639          599      15725 2005-08-23 11:25:00    2.99          83.81

[15640 rows x 5 columns]

#### Expected output

|customer_id|rental_id|rental_date        |amount|running_total|
|-----------|---------|-------------------|------|-------------|
|1          |76       |2005-05-25 11:30:37|2.99  |2.99         |
|1          |573      |2005-05-28 10:35:23|0.99  |3.98         |
|1          |1185     |2005-06-15 00:54:12|5.99  |9.97         |
|1          |1422     |2005-06-15 18:02:53|0.99  |10.96        |
|1          |1476     |2005-06-15 21:08:46|9.99  |20.95        |
|1          |1725     |2005-06-16 15:18:57|4.99  |25.94        |
|1          |2308     |2005-06-18 08:41:48|4.99  |30.93        |
|1          |2363     |2005-06-18 13:33:59|0.99  |31.92        |
|1          |3284     |2005-06-21 06:24:45|3.99  |35.91        |
|1          |4526     |2005-07-08 03:17:05|5.99  |41.90        |

### 4. Determine the quartile for the rental rates of films:

In [25]:
query = '''SELECT
    title,
    rental_rate,
    NTILE(4) OVER (ORDER BY rental_rate) AS quartile
FROM
    film
ORDER BY
    quartile

'''
pd.read_sql_query(query, engine)

                    title  rental_rate  quartile
0        ACADEMY DINOSAUR         0.99         1
1         ALAMO VIDEOTAPE         0.99         1
2          ALASKA PHANTOM         0.99         1
3          ALICE FANTASIA         0.99         1
4              ALONE TRIP         0.99         1
..                    ...          ...       ...
995  WONDERLAND CHRISTMAS         4.99         4
996   WORKING MICROCOSMOS         4.99         4
997         WYOMING STORM         4.99         4
998           YENTL IDAHO         4.99         4
999             ZORRO ARK         4.99         4

[1000 rows x 3 columns]

#### Expected output

|title|rental_rate|quartile           |
|-----|-----------|-------------------|
|ACADEMY DINOSAUR|0.99       |1                  |
|ALAMO VIDEOTAPE|0.99       |1                  |
|ALASKA PHANTOM|0.99       |1                  |
|ALICE FANTASIA|0.99       |1                  |
|ALONE TRIP|0.99       |1                  |
|ALTER VICTORY|0.99       |1                  |
|AMADEUS HOLY|0.99       |1                  |
|ANACONDA CONFESSIONS|0.99       |1                  |
|ANNIE IDENTITY|0.99       |1                  |
|ANONYMOUS HUMAN|0.99       |1                  |

### 5. Determine the first and last rental date for each customer:

In [30]:
query = '''SELECT
    rental.customer_id,
    MIN(rental.rental_date) AS first_rental_date,
    MAX(rental.rental_date) AS last_rental_date
FROM
    rental
GROUP BY
    rental.customer_id;

'''
pd.read_sql_query(query, engine)

     customer_id   first_rental_date    last_rental_date
0              1 2005-05-25 11:30:37 2005-08-22 20:03:46
1              2 2005-05-27 00:09:24 2005-08-23 17:39:35
2              3 2005-05-27 17:17:09 2005-08-23 07:10:14
3              4 2005-06-15 09:31:28 2005-08-23 07:43:00
4              5 2005-05-29 07:25:16 2006-02-14 15:16:03
..           ...                 ...                 ...
594          595 2005-05-28 15:27:22 2005-08-23 21:26:35
595          596 2005-05-26 21:16:52 2006-02-14 15:16:03
596          597 2005-05-25 04:19:28 2006-02-14 15:16:03
597          598 2005-06-20 10:10:29 2005-08-23 00:44:15
598          599 2005-05-31 01:18:56 2005-08-23 11:25:00

[599 rows x 3 columns]

#### Expected result

|customer_id|first_rental_date|last_rental_date   |
|-----------|-----------------|-------------------|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|
|1          |2005-05-25 11:30:37|2005-08-22 20:03:46|

### 6. Calculate the rank of customers based on their rental counts:

In [33]:
query = '''SELECT
    customer.customer_id,
    COUNT(rental.rental_id) AS rental_count,
    RANK() OVER (ORDER BY COUNT(rental.rental_id) DESC) AS rental_rank
FROM
    customer
LEFT JOIN rental ON customer.customer_id = rental.customer_id
GROUP BY
    customer.customer_id
ORDER BY
    rental_rank;
'''

pd.read_sql_query(query, engine)

     customer_id  rental_count  rental_rank
0            148            46            1
1            526            45            2
2            144            42            3
3            236            42            3
4             75            41            5
..           ...           ...          ...
579          136            15          579
580           61            14          581
581          110            14          581
582          281            14          581
583          318            12          584

[584 rows x 3 columns]

#### Expected output

|customer_id|rental_count                 |rental_count_rank|
|-----------|-----------------------------|-----------------|
|148        |46                           |1                |
|526        |45                           |2                |
|144        |42                           |3                |
|236        |42                           |3                |
|75         |41                           |5                |
|197        |40                           |6                |
...|...|...

### 7. Calculate the running total of revenue per day for the 'G' film category:

In [46]:
query = '''WITH FamilyFilmPayments AS (
    SELECT
        CONCAT(category.name, ' - ', film.title) AS film_category,
        rental.rental_date AS rental_date,
        payment.amount
    FROM
        payment
    JOIN
        rental ON payment.rental_id = rental.rental_id
    JOIN
        inventory ON rental.inventory_id = inventory.inventory_id
    JOIN
        film ON inventory.film_id = film.film_id
    JOIN
        film_category ON film.film_id = film_category.film_id
    JOIN
        category ON film_category.category_id = category.category_id
    WHERE
        category.name = 'Family'
)

SELECT
    film_category,
    rental_date,
    amount,
    SUM(amount) OVER (ORDER BY rental_date) AS daily_revenue
FROM
    FamilyFilmPayments
ORDER BY
    rental_date;

'''

pd.read_sql_query(query, engine)

                    film_category         rental_date  amount  daily_revenue
0        Family - BLANKET BEVERLY 2005-05-24 22:53:30    2.99           2.99
1         Family - KING EVOLUTION 2005-05-25 00:22:55    6.99           9.98
2          Family - APACHE DIVINE 2005-05-25 01:59:46    4.99          14.97
3     Family - MANCHURIAN CURTAIN 2005-05-25 04:47:44    4.99          19.96
4            Family - GANDHI KWAI 2005-05-25 13:52:43    0.99          20.95
...                           ...                 ...     ...            ...
1091       Family - HALF OUTFIELD 2006-02-14 15:16:03    2.99        4226.07
1092       Family - HALF OUTFIELD 2006-02-14 15:16:03    0.00        4226.07
1093          Family - JASON TRAP 2006-02-14 15:16:03    2.99        4226.07
1094   Family - MOVIE SHAKESPEARE 2006-02-14 15:16:03    0.00        4226.07
1095   Family - OPPOSITE NECKLACE 2006-02-14 15:16:03    4.99        4226.07

[1096 rows x 4 columns]

#### Expected ouput

|film_category|rental_date                  |amount|daily_revenue|
|-------------|-----------------------------|------|-------------|
|BLANKET BEVERLY|2005-05-24 22:53:30          |2.99  |2.99         |
|GRADUATE LORD|2005-05-24 23:03:39          |3.99  |3.99         |
|LAWLESS VISION|2005-05-24 23:31:46          |4.99  |4.99         |
|HANGING DEEP |2005-05-25 00:02:21          |5.99  |5.99         |
|MONTEREY LABYRINTH|2005-05-25 00:31:15          |0.99  |0.99         |
|SCISSORHANDS SLUMS|2005-05-25 01:48:41          |2.99  |2.99         |
|EASY GLADIATOR|2005-05-25 03:41:50          |4.99  |4.99         |

### 8. Assign a unique ID to each payment within each customer's payment history:

In [49]:
query = '''WITH CustomerPayments AS (
    SELECT
        customer_id,
        payment_id,
        payment_date,
        ROW_NUMBER() OVER (PARTITION BY customer_id ORDER BY payment_date) AS payment_sequence_id
    FROM
        payment
)

SELECT
    CustomerPayments.customer_id,
    CustomerPayments.payment_id,
    CustomerPayments.payment_sequence_id
FROM
    CustomerPayments
ORDER BY
    CustomerPayments.customer_id, CustomerPayments.payment_date;

'''

pd.read_sql_query(query, engine)

       customer_id  payment_id  payment_sequence_id
0                1           1                    1
1                1           2                    2
2                1           3                    3
3                1           4                    4
4                1           5                    5
...            ...         ...                  ...
16044          599       16045                   15
16045          599       16046                   16
16046          599       16047                   17
16047          599       16048                   18
16048          599       16049                   19

[16049 rows x 3 columns]

|customer_id|payment_id|payment_sequence_id|
|-----------|----------|-------------------|
|1          |1         |1                  |
|1          |2         |2                  |
|1          |3         |3                  |
|1          |4         |4                  |
|1          |5         |5                  |
|1          |6         |6                  |
|1          |7         |7                  |
|1          |8         |8                  |
|1          |9         |9                  |
|1          |10        |10                 |
|1          |11        |11                 |
|1          |12        |12                 |
|1          |13        |13                 |
|1          |14        |14                 |
|1          |15        |15                 |
|1          |16        |16                 |
|1          |17        |17                 |
|1          |18        |18                 |
|1          |19        |19                 |
|1          |20        |20                 |
|1          |21        |21                 |
|1          |22        |22                 |
|1          |23        |23                 |
|1          |24        |24                 |
|1          |25        |25                 |
|1          |26        |26                 |
|1          |27        |27                 |
|1          |28        |28                 |
|1          |29        |29                 |
|1          |30        |30                 |
|1          |31        |31                 |
|1          |32        |32                 |
|2          |33        |1                  |
|2          |34        |2                  |
|2          |35        |3                  |
|2          |36        |4                  |
|2          |37        |5                  |
|2          |38        |6                  |
|2          |39        |7                  |
|2          |40        |8                  |
|2          |41        |9                  |
|2          |42        |10                 |
|2          |43        |11                 |
|2          |44        |12                 |

### 9. Calculate the difference in days between each rental and the previous rental for each customer:

In [52]:
query = ''' WITH RentalWithPrevious AS (
    SELECT
        rental.customer_id,
        rental.rental_id,
        rental.rental_date,
        LAG(rental.rental_date) OVER (PARTITION BY rental.customer_id ORDER BY rental.rental_date) AS previous_rental_date
    FROM
        rental
)

SELECT
    RentalWithPrevious.customer_id,
    RentalWithPrevious.rental_id,
    RentalWithPrevious.rental_date,
    RentalWithPrevious.previous_rental_date,
    DATEDIFF(RentalWithPrevious.rental_date, RentalWithPrevious.previous_rental_date) AS days_between_rentals
FROM
    RentalWithPrevious
ORDER BY
    RentalWithPrevious.customer_id, RentalWithPrevious.rental_date;

'''

pd.read_sql_query(query, engine)

,customer_id,rental_id,rental_date,previous_rental_date,days_between_rentals
0,1,76,2005-05-25 11:30:37,NaT,NaN
1,1,573,2005-05-28 10:35:23,2005-05-25 11:30:37,3.0
2,1,1185,2005-06-15 00:54:12,2005-05-28 10:35:23,18.0
3,1,1422,2005-06-15 18:02:53,2005-06-15 00:54:12,0.0
4,1,1476,2005-06-15 21:08:46,2005-06-15 18:02:53,0.0
...,...,...,...,...,...
16040,599,14599,2005-08-21 17:43:42,2005-08-21 05:07:08,0.0
16041,599,14719,2005-08-21 21:41:57,2005-08-21 17:43:42,0.0
16042,599,15590,2005-08-23 06:09:44,2005-08-21 21:41:57,2.0
16043,599,15719,2005-08-23 11:08:46,2005-08-23 06:09:44,0.0
16044,599,15725,2005-08-23 11:25:00,2005-08-23 11:08:46,0.0

#### Expected output


|customer_id|rental_id|rental_date        |previous_rental_date|days_between_rentals|
|-----------|---------|-------------------|--------------------|--------------------|
|1          |76       |2005-05-25 11:30:37|NULL                |NULL                |
|1          |573      |2005-05-28 10:35:23|2005-05-25 11:30:37 |3                   |
|1          |1185     |2005-06-15 00:54:12|2005-05-28 10:35:23 |18                  |
|1          |1422     |2005-06-15 18:02:53|2005-06-15 00:54:12 |0                   |
|1          |1476     |2005-06-15 21:08:46|2005-06-15 18:02:53 |0                   |
|1          |1725     |2005-06-16 15:18:57|2005-06-15 21:08:46 |1                   |
|1          |2308     |2005-06-18 08:41:48|2005-06-16 15:18:57 |2                   |
|1          |2363     |2005-06-18 13:33:59|2005-06-18 08:41:48 |0                   |
|1          |3284     |2005-06-21 06:24:45|2005-06-18 13:33:59 |3                   |
|1          |4526     |2005-07-08 03:17:05|2005-06-21 06:24:45 |17                  |
|1          |4611     |2005-07-08 07:33:56|2005-07-08 03:17:05 |0                   |